def label():
    print(
        f"""
\033[1;31m8888888b.           888      \033[1;37m8888888b.           888
\033[1;31m888   Y88b          888      \033[1;37m888   Y88b          888
\033[1;31m888    888          888      \033[1;37m888    888          888
\033[1;31m888   d88P 88888b.  88888b.  \033[1;37m888   d88P  .d88b.  888888
\033[1;31m8888888P"  888 "88b 888 "88b \033[1;37m8888888P"  d88""88b 888
\033[1;31m888 T88b   888  888 888  888 \033[1;37m888 T88b   888  888 888
\033[1;31m888  T88b  888  888 888 d88P \033[1;37m888  T88b  Y88..88P Y88b.
\033[1;31m888   T88b 888  888 88888P"  \033[1;37m888   T88b  "Y88P"   "Y888
    """
    )

def menu():
    print(
        f"""
\033[1;32m======================================================
            Шифрование Текстовой Информации
======================================================\033[0m

\033[1m\033[9[Выберите действие:\033[0m

\033[033;35m[1]. Зашифровать текст из файла
[2]. Зашифровать введенный текст
===============================
[3]. Расшифровать текст из файла
[4]. Расшифровать введенный текст
===============================
[5]. Правила пользования
===============================
[6]. Выход\033[0m
"""
    )

def how_to_use():
    print("\033[1;31m╔════════════════════════════════════════════════════════════════════╗\033[0m")
    print("\033[1;31m║   Не переименовывайте zip файл с ключом и текстовый файл с ключом! ║\033[0m")
    print("\033[1;31m║                    Пароли не отображаются                          ║\033[0m")
    print("\033[1;31m║               при вводе в целях безопасности.                      ║\033[0m")
    print("\033[1;31m╚════════════════════════════════════════════════════════════════════╝\033[0m")